/****************************************Copyright (c)**************************************************
**                               福建师范大学物理与能源学院
**------------------------------------------------------------------------------------------------------
** 文件: Protocol.c
** 版本: v1.0
**------------------------------------------------------------------------------------------------------
** 描述:
**     本模块主要涉及电力载波通信操作函数
** Author:HE
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include "config.h"
#include "Protocol.h"


/*******************************************************************************************************
** 函数: int UsartPtlSend
**------------------------------------------------------------------------------------------------------
** 参数:  unsigned char Ctrl：控制域
          unsigned char Cmd：指令字
					char *UserData：用户数据区指针
					unsigned char UserDataLen：用户数据长度
**       
** 返回: 返回发送数据帧长度
** 说明: 通过串口发送一帧数据
** Author:HE
********************************************************************************************************/
int UsartPtlSend( unsigned char Ctrl,unsigned char Cmd,unsigned char *UserData,unsigned char UserDataLen)
{
 	unsigned char *pData = Usart0Buf; 							// 协议区
 //	unsigned char *pUserData = Usart0Buf+5; 								// 指向用户数据区区域
	unsigned char i;	
	//-------------------------------------------------------------------------------
	// 封装数据帧
	pData[0]= 0x79 ; 											// 封装数据头
	
	pData[1]= UserDataLen;               // 封装帧长度 L  注意：大于1字节的域，均使用小端字节序传输
	pData[2]= 0x00;
	
	pData[3]= Ctrl ;
	pData[4]= Cmd ;											  // 封装命令字

	
	for(i=0;i<UserDataLen;i++)  pData[i+5] = *(UserData++);
//	   pUserData[i] = *(UserData++);
	
	pData[UserDataLen+5] = ToolCalcSum( pData + 1, UserDataLen + 4);// 和校验，包括L,Ctrl,Cmd,Data所有字节算术和，不考虑溢出
	
	pData[UserDataLen+6] = ToolCalcXor8(pData + 1, UserDataLen + 4 );//异或校验，初始值为0，是L,Ctrl,Cmd,Data所有字节的异或
	
	Usart0_SendBuf(pData,UserDataLen + 7); //发送帧的总长度为：帧头79H（1字节）+ 数据域Data的长度L（2字节）+ 控制域Ctrl(1字节) + 指令字(1字节) + 数据域Data(UserDataLen) + 和校验CSUM(1字节) + 异或校验CXOR(1字节)
	
	return UserDataLen + 7;
}

/*******************************************************************************************************
** 函数: UsartPackValid,检验接收到的数据包
**------------------------------------------------------------------------------------------------------
** 参数: char * buf ：数据 
         unsigned short len	：长度
** 返回: 成功：TRUE  失败：FALSE
** Author:HE
********************************************************************************************************/
BOOL UsartPackValid( unsigned char * buf , unsigned short len )
{
	unsigned char *pBuf=NULL;
//	unsigned short pBufLen=0; //预留，未用
	unsigned short UserDataLen;
	//-------------------------------------------------------------------------------
	// 数据包检验
	if(buf[0]!=0x79)	return FALSE;
    UserDataLen = (buf[2] << 8) + buf[1]; 
	
	pBuf = &buf[0];
//	pBufLen = len;//预留，未用
	
	if(pBuf[UserDataLen+5] != ToolCalcSum( pBuf + 1, UserDataLen + 4)) //和验证
		return FALSE;
		
	if(pBuf[UserDataLen+6] != ToolCalcXor8( pBuf + 1, UserDataLen + 4 )) //CRC验证
		return FALSE;
	//-------------------------------------------------------------------------------
	// ASCII数据包，校验位清除
//	pBuf[UserDataLen+5]='\0';
//	pBuf[UserDataLen+6]='\0';
	return TRUE;
}



/*******************************************************************************************************
** 函数: UsartPtlRec收包处理 
**------------------------------------------------------------------------------------------------------
** 参数: char * buf ：数据 uint16 len	：长度
** 返回: 成功：TRUE  失败：FALSE
** Author:HE
********************************************************************************************************/
BOOL UsartPtlRec( unsigned char * buf , unsigned short len )
{					 
  unsigned char i;
	//----------------------------------------------------------------
	// 数据包检验
	if(!UsartPackValid(buf,len))	return FALSE;					// 数据包校验
 
	//打印测试收到的数据
	for(i=0;i<len;i++)
	{
	//	Usart1_SendCh(buf[i]);
	}


	//后期请补充各种收包处理
	
	
	//----------------------------------------------------------------
	// 正确回应
	return TRUE;		
}



/********************************************************************************************************
**                            End Of File
********************************************************************************************************/
